Revit 2027 API
Blend.TopSketch Property
Returns the Top Sketch of the Blend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Sketch TopSketch { get; }
Public ReadOnly Property TopSketch As Sketch
	Get
public:
property Sketch^ TopSketch {
	Sketch^ get ();
}
member TopSketch : Sketch with get
Property Value
Sketch
Remarks
This property is used to retrieve the Top Sketch of the Blend.
See Also
Reference
Blend Class
Autodesk.Revit.DB Namespace